-- =====================
-- CREATE TABLE
-- =====================

CREATE TABLE 사원 (
                    사원번호 int        PRIMARY KEY,
                    이름     VARCHAR(50)  NOT NULL,
                    입사일   DATE         NOT NULL,
                    호봉     INT          NOT NULL default 10,
                    휴대폰   VARCHAR(20) unique
);

INSERT INTO 사원 (사원번호,이름, 입사일, 호봉, 휴대폰) VALUES
                                           (1201,'김철수', '2018-03-02', 15, '010-1234-5678'),
                                           (1202,'김정아', '2018-03-02', 20, '010-1500-5600'),
                                           (1203,'김수철', '2018-03-02', 21, '010-1230-5670'),
                                           (1204,'김수', '2018-03-02', 14, '010-1200-5000'),
                                           (1205,'이영', '2020-07-15', 17, '010-2345-6789'),
                                           (1206,'박민준', '2015-11-01', 10, '010-3456-7890'),
                                           (1207,'최수연', '2022-01-10', 1, NULL),
                                           (1208,'정다은', '2019-05-20', default, '010-5678-9012');

CREATE TABLE 부서 (
                    부서번호     int       PRIMARY KEY,
                    부서명   VARCHAR(100)  NOT NULL default '학생과',
                    부서장 int UNIQUE,
                    사무실   VARCHAR(100)  NOT NULL UNIQUE,
                    전화번호 VARCHAR(13)   UNIQUE
);



INSERT INTO 부서 (부서번호,부서명, 부서장,사무실, 전화번호) VALUES
                                             (100,'개발팀',1101   ,'A301', '02-0000-1111'),
                                             (200,'인사팀',   1102,'B201', '02-0000-2222'),
                                             (300,'마케팅팀', 1201,'C101', NULL),
                                             (400,'재무팀',  NULL ,'A401', '02-1111-2222'),
                                             (500,default, 1208 ,'A401', '02-1111-2222');


CREATE TABLE 근무하다 (
                      사원번호 INT          REFERENCES 사원(사원번호),
                      부서번호     INT      REFERENCES 부서(부서번호),
                      직책     VARCHAR(50)  NOT NULL,
);

insert into 근무하다 values
                     (1101,100,'부장'),
                     (1102,200,'대리'),
                     (1103,200,'사원'),
                     (1201,300,'부장'),
                     (1202,300,'대리'),
                     (1203,300,'과장'),
                     (1204,300,'사원'),
                     (1312,300,'사원');

select * from 근무하다 where 직책 = '사원';

